CI4/app/Controllers/Aluno.php

    public function index() {
    $model = new AlunoModel();
    $data['alunos'] = $model->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `alunos`
ORDER BY `id` ASC

    public function store() {
        $model = new AlunoModel();
        // Regras de validação
        $rules = [
            'nome'     => 'required',
            'endereco' => 'required',
            'email'    => 'required|valid_email'
        ];
        if (! $this->validate($rules)) {
            // Erro na validação: reexibe formulário com mensagens
            return view('alunos/create', [
                'validation' => $this->validator
            ]);
        }
        // Dados válidos: salva no BD
        $model->insert([
            'nome'     => $this->request->getPost('nome'),
            'endereco' => $this->request->getPost('endereco'),
            'email'    => $this->request->getPost('email')
        ]);
---
INSERT INTO `alunos` (`nome`, `endereco`, `email`) VALUES ('Sebastião Braga de Mesquita', 'santa teresa do zé lima', 'sebastiao@gmail.com')

    public function edit($id) {
        $model = new AlunoModel();
        $data['aluno'] = $model->find($id);
---
SELECT *
FROM `alunos`
WHERE `alunos`.`id` = '8'